def get_cats_info(path):
    """
    розробити функцію get_cats_info(path), яка читає цей файл та повертає список словників з інформацією про кожного кота.
    Вимоги до завдання:

    Функція get_cats_info(path) має приймати один аргумент - шлях до текстового файлу (path).
    Файл містить дані про котів, де кожен запис містить унікальний ідентифікатор, ім'я кота та його вік.
    Функція має повертати список словників, де кожен словник містить інформацію про одного кота.

    Рекомендації для виконання:
    Використовуйте with для безпечного читання файлу.
    Пам'ятайте про встановлення кодування при відкриті файлів
    Для кожного рядка в файлі використовуйте split(',') для отримання ідентифікатора, імені та віку кота.
    Утворіть словник з ключами "id", "name", "age" для кожного кота та додайте його до списку, який буде повернуто.
    Опрацьовуйте можливі винятки, пов'язані з читанням файлу.

    Критерії оцінювання:
    Функція має точно обробляти дані та повертати правильний список словників.
    Повинна бути належна обробка винятків і помилок.
    Код має бути чистим, добре структурованим і зрозумілим.
    """
    res_list, row_dict = [], {}

    try:
        with open(path, 'r', encoding='utf-8') as file:
            for line in file:
                try:
                    middle_str = line.split(',')
                    row_dict = {
                                    "id": middle_str[0],
                                    "name": middle_str[1],
                                    "age": int(middle_str[2]) 
                    }
                    res_list.append(row_dict)

                except (IndexError, ValueError):
                    continue
            
            return res_list
        
    except FileNotFoundError:
        print("Файл не знайдено")
        return list()
    except Exception as e:
        print("Помилка при обробці файлу:", e)
        return list()

result = get_cats_info("static/2.txt")
print(result)

assert result == [{'id': '60b90c1c13067a15887e1ae1', 'name': 'Tayson', 'age': 3}, {'id': '60b90c2413067a15887e1ae2', 'name': 'Vika', 'age': 1}, {'id': '60b90c2e13067a15887e1ae3', 'name': 'Barsik', 'age': 2}, {'id': '60b90c3b13067a15887e1ae4', 'name': 'Simon', 'age': 12}, {'id': '60b90c4613067a15887e1ae5', 'name': 'Tessi', 'age': 5}], "Incorrect list"
