def total_salary(path):
    """
    total_salary(path), яка аналізує цей файл і повертає загальну та середню суму заробітної плати всіх розробників.

    Функція total_salary(path) має приймати один аргумент - шлях до текстового файлу (path).
    Файл містить дані про заробітні плати розробників, розділені комами. Кожен рядок вказує на одного розробника.
    Функція повинна аналізувати файл, обчислювати загальну та середню суму заробітної плати.
    Результатом роботи функції є кортеж із двох чисел: загальної суми зарплат і середньої заробітної плати.

    Рекомендації для виконання:
    Використовуйте менеджер контексту with для читання файлів.
    Пам'ятайте про встановлення кодування при відкриті файлів
    Для розділення даних у кожному рядку можна застосувати метод split(',').
    Обрахуйте загальну суму заробітної плати, а потім розділіть її на кількість розробників, щоб отримати середню зарплату.
    Опрацьовуйте можливі винятки при роботі з файлами, такі як відсутність файлу.

    Критерії оцінювання:
    Функція повинна точно обчислювати загальну та середню суми.
    Повинна бути обробка випадків, коли файл відсутній або пошкоджений.
    Код має бути чистим, добре структурованим і зрозумілим.
    """
    total = 0
    count = 0

    try:
        with open(path, 'r', encoding='utf-8') as file:
            for line in file:
                try:
                    salary = float(line.strip().split(',')[1])
                    total += salary
                    count += 1
                except (IndexError, ValueError):
                    continue

        if count == 0:
            return 0, 0
        else:
            average = total / count
            return total, average

    except FileNotFoundError:
        print("Файл не знайдено")
        return 0, 0
    except Exception as e:
        print("Помилка при обробці файлу:", e)
        return 0, 0


total, average = total_salary("static/1.txt")
result_message = f"Загальна сума заробітної плати: {total}, Середня заробітна плата: {average}"
print(result_message)

assert result_message == "Загальна сума заробітної плати: 6000.0, Середня заробітна плата: 2000.0", "Incorrect message"



